#include <vector>

// https://leetcode.cn/problems/rotate-image/

using namespace std;

class Solution 
{
public:
    //1. 遍历
    //将nxn矩阵视作由外向内的若干层“方环”，每一层独立进行旋转，互不干扰，遍历的总层数为n/2(向下取整），对于每一层(设层数为count，从0开始)，其有效遍历范围随层数深入而收缩
    //从当前层的顶边选择一个起始元素，通过固定的点位索引关系确定上/右/下/左4条边上的4个点，并按照顺时针对4个点进行旋转替补，对于第count层，只需要遍历顶边前n-count-1个元素即可
    //count表示当前的层数(从0开始)，每层遍历之后递增，代表元素坐标的左边界(同时也是上边界)，n初始化为矩阵的边长，每次遍历后递减，代表元素左边的右边界(同时也是下边界)
    //旋转的4个元素的坐标可以根据公式来获得，假设某个点为第count层顶边的第i个元素，则顶边元素坐标为[count, count+i](count层顶部坐标[count, count]横向偏移i个元素)
    //右边元素坐标为[count+i,n-1](上边界向下偏移i个元素，并处于右边界上)，底边元素坐标为[n-1, n-1-i](在下边界上，从右边界向左偏移i个元素)
    //左边元素坐标为[n-1-i,count](下边界向上偏移i个元素，并处于左边界上)，按照上->右->下->左->上的顺序替换4个元素即可完成旋转
    void rotate(vector<vector<int>>& matrix) 
    {
        if (matrix.size() == 0)
        {
            return;
        }

        int n = matrix.size();
        int count = 0;
        while (count < matrix.size() / 2)
        {
            for (int i = 0; i < n - count -  1; ++i)
            {
                int x1 = count;
                int y1 = count + i;
                int temp1 = matrix[x1][y1];

                int x2 = count + i;
                int y2 = n - 1;
                int temp2 = matrix[x2][y2];

                int x3 = n - 1;
                int y3 = n - 1 - i;
                int temp3 = matrix[x3][y3];

                int x4 = n - 1 - i;
                int y4 = count;
                int temp4 = matrix[x4][y4];

                matrix[x1][y1] = temp4;
                matrix[x2][y2] = temp1;
                matrix[x3][y3] = temp2;
                matrix[x4][y4] = temp3;
            }

            ++count;
            --n;
        }
    }
};

// int main(int argc, char** argv)
// {
//     Solution s;

//     //输入：matrix = [[1,2,3],[4,5,6],[7,8,9]]
//     //输出：[[7,4,1],[8,5,2],[9,6,3]]
//     vector<vector<int>> matrix = vector<vector<int>>{
//         {1, 2, 3},
//         {4, 5, 6},
//         {7, 8, 9},
//     };
//     s.rotate(matrix);

//     //[0,0] [0,2] [2,2] [2,0]
//     //[0,1] [1,2] [2,1],[1,0] 

//     //输入：matrix = [[5,1,9,11],[2,4,8,10],[13,3,6,7],[15,14,12,16]]
//     //输出：[[15,13,2,5],[14,3,4,1],[12,6,8,9],[16,7,10,11]]
//     matrix = vector<vector<int>>{
//         {5,1,9,11},
//         {2,4,8,10},
//         {13,3,6,7},
//         {15,14,12,16},
//     };
//     //[0,0] [0,3] [3,3] [3,0]
//     //[0,1] [1,2] [3,2] []
//     s.rotate(matrix);

//     //[[2,29,20,26,16,28],[12,27,9,25,13,21],[32,33,32,2,28,14],[13,14,32,27,22,26],[33,1,20,7,21,7],[4,24,1,6,32,34]]
//     //[[4,33,13,32,12,2]
//     //[24,1,14,33,27,29]
//     //[1,20,32,32,9,20]
//     //[6,7,27,2,25,26]
//     //[32,21,22,28,13,16]
//     //[34,7,26,14,21,28]]
//     matrix = vector<vector<int>>{
//         {2, 29,20,26,16,28},
//         {12,27,9, 25,13,21},
//         {32,33,32,2, 28,14},
//         {13,14,32,27,22,26},
//         {33,1, 20,7, 21,7},
//         {4, 24,1, 6, 32,34}
//     };
//     s.rotate(matrix);

//     return 0;
// }